cf_billing/InformationRegisters/энргУстановленныеПараметрыРасчетаНорматива.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргУстановленныеПараметрыРасчетаНорматива</Name>
			<InformationRegisterPeriodicity>Year</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргТипыНачислений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Разрез</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргКлючевыеПараметрыНорматива</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеИспользованияТУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргНаправлениеИспользованияТочекУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СоциальныйНорматив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Enums/энргКлючевыеПараметрыНорматива.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргКлючевыеПараметрыНорматива</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВидБлагоустройства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидСобственности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГодПостройки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоКомнат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоЧеловек</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоЭтажей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзмерительНаправленияИспользования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТипМестности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТипПлиты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщаяПлощадьМОПНаЧеловека</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоСобственников</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоПрописанных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоПроживающих</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Enums/энргТипыНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргТипыНачислений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныеНачисления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщедомовыеНачисления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтдельностояющиеОбъекты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЮридическиеЛица</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Catalogs/энргВидыУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргВидыУслуг</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>бестИспользоватьТемпературныйКоэффициентПоВоде</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бестИспользоватьТемпературныйКоэффициентПоВоздуху</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бестКоличествоЧасовНештатнойРаботы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлощади</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргВидыПлощадей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлощадиМКД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргВидыПлощадей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗависитОтУслуги</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьКоэффициентСдерживанияРостаПлаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорректироватьГодовойОбъем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорректироватьИндивидуальныйОбъемСУчетомОДПУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачислятьПоСостояниюНаНачалоРасчетногоПериода</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормативДляИндивидуальных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сезонность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыСезонности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СезонностьНастраивается</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержитПотери</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоставнаяУслуга</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОпределенияСоциальнойНормы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСпособыОпределенияСоциальнойНормы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипУслуги</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргТипыУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестТовары</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВыводить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИспользоватьПовыщающийКоэффициент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПоставщикУслуги</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьРаспределятьТолькоПоОДПУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСезонность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдлаитьэнргВидыСезонности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСоциальныйНормативРавенНормативуПотребления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСпособОпределенияНормы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСпособыОпределенияНормы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСпособРасчетаНорматива</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСпособРасчетаНорматива</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСпособРасчетаОбъема</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСпособРасчетаОбъема</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьУменьшатьБазуЕслиВсеСПУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособДосчётаРесурса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестСпособыДосчётаРесурса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бестЗависитОтУслугиПоПотерям</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бестОсновнаяУслугаДляРасчетаБалансовымМетодом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПрименятьЗависимостьЕслиБольшеОднойТочки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бестИспользоватьРасчетПоМощности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бестИспользоватьРасчетЭлектроэнергии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьРасчетРеактивнойЭнергии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставляющиеУслуг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтправлятьИнфПоПУВГИСЖКХ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФормулыРасчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СпособНачисления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргСпособНачислений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормулаРасчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Условие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бестТовары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗависимыеУслуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УслугаЗависитОт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставляющиеБалансовыхУслуг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/InformationRegisters/энргУстановленныеПараметрыРасчетаНорматива/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет действующую разрезы норматива.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ДействующуюРазрезыНорматива(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаДействующуюПараметрыРасчетаНорматива());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	
КонецПроцедуры

// Заполняет действующую разрезы норматива коллекция периодов.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаПериодов		-	Строка..
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ДействующуюРазрезыНормативаКоллекцияПериодов(Схема,ПараметрыОтбора,ТаблицаПериодов,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаДействующуюРазрезыНормативаКоллекцияПериодов());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	
КонецПроцедуры

// Получает структуру параметров разреза.
// 
// Возвращаемое значение:
//   ФиксированнаяСтруктура.
//
Функция СтруктураПараметровРазреза() Экспорт
	Менеджер = Перечисления.энргКлючевыеПараметрыНорматива;
	
	Возврат Новый ФиксированнаяСтруктура("
	|РазрезВидБлагоустройства,РазрезВидСобственности,РазрезГодПостройки,
	|РазрезКоличествоКомнат,РазрезКоличествоЧеловек,РазрезКоличествоПрописанных,РазрезКоличествоПроживающих,РазрезКоличествоЭтажей,РазрезИзмерительНаправленияИспользования",
	Менеджер.ВидБлагоустройства, Менеджер.ВидСобственности, Менеджер.ГодПостройки,
	Менеджер.КоличествоКомнат, Менеджер.КоличествоЧеловек,Менеджер.КоличествоПрописанных,Менеджер.КоличествоПроживающих, Менеджер.КоличествоЭтажей, Менеджер.ИзмерительНаправленияИспользования);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаДействующуюПараметрыРасчетаНорматива()
	Текст  = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ВложенныйЗапрос.СоциальныйНорматив КАК СоциальныйНорматив,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.ВидБлагоустройства)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК РазрезВидБлагоустройства,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.ВидСобственности)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК РазрезВидСобственности,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.ГодПостройки)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК РазрезГодПостройки,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.КоличествоКомнат)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК РазрезКоличествоКомнат,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.КоличествоЧеловек)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК РазрезКоличествоЧеловек,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.КоличествоПроживающих)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК РазрезКоличествоПроживающих,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.КоличествоПрописанных)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК РазрезКоличествоПрописанных,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.КоличествоЭтажей)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК РазрезКоличествоЭтажей,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.ИзмерительНаправленияИспользования)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК РазрезИзмерительНаправленияИспользования,
	|	ВложенныйЗапрос.ТипНачисления КАК ТипНачисления
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Услуга КАК Услуга,
	|		энргУстановленныеПараметрыРасчетаНорматива.Разрез КАК Разрез,
	|		энргУстановленныеПараметрыРасчетаНорматива.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|		энргУстановленныеПараметрыРасчетаНорматива.СоциальныйНорматив КАК СоциальныйНорматив,
	|		ВложенныйЗапрос.ТипНачисления КАК ТипНачисления
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВложенныйЗапрос.Услуга КАК Услуга,
	|			ВложенныйЗапрос.ТипНачисления КАК ТипНачисления,
	|			МАКСИМУМ(ВложенныйЗапрос.Период) КАК Период,
	|			ВложенныйЗапрос.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|			ВложенныйЗапрос.СоциальныйНорматив КАК СоциальныйНорматив
	|		ИЗ
	|			(ВЫБРАТЬ
	|				энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.Услуга КАК Услуга,
	|				энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.ТипНачисления КАК ТипНачисления,
	|				энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.Период КАК Период,
	|				энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|				энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.СоциальныйНорматив КАК СоциальныйНорматив
	|			ИЗ
	|				РегистрСведений.энргУстановленныеПараметрыРасчетаНорматива.СрезПоследних(
	|						&МоментВремени,
	|						Организация = &Организация
	|							И Район = &Район
	|							И (ВЫБОР
	|								КОГДА &ТипНачисления = ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.ПустаяСсылка)
	|									ТОГДА ИСТИНА
	|								ИНАЧЕ ТипНачисления = &ТипНачисления
	|							КОНЕЦ)) КАК энргУстановленныеПараметрыРасчетаНормативаСрезПоследних
	|			
	|			ОБЪЕДИНИТЬ ВСЕ
	|			
	|			ВЫБРАТЬ
	|				энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.Услуга,
	|				энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.ТипНачисления,
	|				энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.Период,
	|				энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.НаправлениеИспользованияТУ,
	|				энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.СоциальныйНорматив
	|			ИЗ
	|				РегистрСведений.энргУстановленныеПараметрыРасчетаНорматива.СрезПоследних(
	|						&МоментВремени,
	|						Организация = &Организация
	|							И Район = &Район
	|							И ТипНачисления = ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.ИндивидуальныеНачисления)) КАК энргУстановленныеПараметрыРасчетаНормативаСрезПоследних
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|					ПО энргУстановленныеПараметрыРасчетаНормативаСрезПоследних.Услуга = энргВидыУслуг.Ссылка
	|						И (энргВидыУслуг.НормативДляИндивидуальных)
	|						И (НЕ &ТипНачисления = ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.ИндивидуальныеНачисления))) КАК ВложенныйЗапрос
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВложенныйЗапрос.Услуга,
	|			ВложенныйЗапрос.ТипНачисления,
	|			ВложенныйЗапрос.НаправлениеИспользованияТУ,
	|			ВложенныйЗапрос.СоциальныйНорматив) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргУстановленныеПараметрыРасчетаНорматива КАК энргУстановленныеПараметрыРасчетаНорматива
	|			ПО ВложенныйЗапрос.Услуга = энргУстановленныеПараметрыРасчетаНорматива.Услуга
	|				И ВложенныйЗапрос.Период = энргУстановленныеПараметрыРасчетаНорматива.Период
	|				И (энргУстановленныеПараметрыРасчетаНорматива.Организация = &Организация)
	|				И (энргУстановленныеПараметрыРасчетаНорматива.Район = &Район)
	|				И ВложенныйЗапрос.ТипНачисления = энргУстановленныеПараметрыРасчетаНорматива.ТипНачисления
	|				И ВложенныйЗапрос.НаправлениеИспользованияТУ = энргУстановленныеПараметрыРасчетаНорматива.НаправлениеИспользованияТУ
	|				И ВложенныйЗапрос.СоциальныйНорматив = энргУстановленныеПараметрыРасчетаНорматива.СоциальныйНорматив) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Услуга,
	|	ВложенныйЗапрос.НаправлениеИспользованияТУ,
	|	ВложенныйЗапрос.СоциальныйНорматив,
	|	ВложенныйЗапрос.ТипНачисления";	
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаДействующуюРазрезыНормативаКоллекцияПериодов()
	
	Текст  = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ВложенныйЗапрос.СоциальныйНорматив КАК СоциальныйНорматив,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.ВидБлагоустройства)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК РазрезВидБлагоустройства,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.ВидСобственности)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК РазрезВидСобственности,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.ГодПостройки)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК РазрезГодПостройки,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.КоличествоКомнат)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК РазрезКоличествоКомнат,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.КоличествоЧеловек)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК РазрезКоличествоЧеловек,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.КоличествоПрописанных)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК РазрезКоличествоПрописанных,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.КоличествоПроживающих)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК РазрезКоличествоПроживающих,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.КоличествоЭтажей)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК РазрезКоличествоЭтажей,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВложенныйЗапрос.Разрез = ЗНАЧЕНИЕ(Перечисление.энргКлючевыеПараметрыНорматива.ИзмерительНаправленияИспользования)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК РазрезИзмерительНаправленияИспользования,
	|	ВложенныйЗапрос.ТипНачисления КАК ТипНачисления
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|		ВложенныйЗапрос.Услуга КАК Услуга,
	|		энргУстановленныеПараметрыРасчетаНорматива.Разрез КАК Разрез,
	|		энргУстановленныеПараметрыРасчетаНорматива.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|		энргУстановленныеПараметрыРасчетаНорматива.СоциальныйНорматив КАК СоциальныйНорматив,
	|		энргУстановленныеПараметрыРасчетаНорматива.ТипНачисления КАК ТипНачисления
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|			ВложенныйЗапрос.Услуга КАК Услуга,
	|			ВложенныйЗапрос.ТипНачисления КАК ТипНачисления,
	|			МАКСИМУМ(ВложенныйЗапрос.Период) КАК Период,
	|			ВложенныйЗапрос.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|			ВложенныйЗапрос.СоциальныйНорматив КАК СоциальныйНорматив
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|				ВложенныйЗапрос.Организация КАК Организация,
	|				ВложенныйЗапрос.Район КАК Район,
	|				ВложенныйЗапрос.ТипНачисления КАК ТипНачисления,
	|				ВложенныйЗапрос.Услуга КАК Услуга,
	|				ВложенныйЗапрос.Разрез КАК Разрез,
	|				ВложенныйЗапрос.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|				ВложенныйЗапрос.СоциальныйНорматив КАК СоциальныйНорматив,
	|				УстановленныеПараметрыРасчетаНорматива.Период КАК Период
	|			ИЗ
	|				(ВЫБРАТЬ
	|					ТаблицаПериодов.ПериодНачисления КАК ПериодНачисления,
	|					УстановленныеПараметрыРасчетаНорматива.Организация КАК Организация,
	|					УстановленныеПараметрыРасчетаНорматива.Район КАК Район,
	|					УстановленныеПараметрыРасчетаНорматива.ТипНачисления КАК ТипНачисления,
	|					УстановленныеПараметрыРасчетаНорматива.Услуга КАК Услуга,
	|					УстановленныеПараметрыРасчетаНорматива.Разрез КАК Разрез,
	|					УстановленныеПараметрыРасчетаНорматива.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|					УстановленныеПараметрыРасчетаНорматива.СоциальныйНорматив КАК СоциальныйНорматив,
	|					МАКСИМУМ(УстановленныеПараметрыРасчетаНорматива.Период) КАК Период
	|				ИЗ
	|					ТаблицаПериодов КАК ТаблицаПериодов
	|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргУстановленныеПараметрыРасчетаНорматива КАК УстановленныеПараметрыРасчетаНорматива
	|						ПО ТаблицаПериодов.Организация = УстановленныеПараметрыРасчетаНорматива.Организация
	|							И ТаблицаПериодов.Район = УстановленныеПараметрыРасчетаНорматива.Район
	|							И (ВЫБОР
	|								КОГДА &ТипНачисления = ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.ПустаяСсылка)
	|									ТОГДА ИСТИНА
	|								ИНАЧЕ УстановленныеПараметрыРасчетаНорматива.ТипНачисления = &ТипНачисления
	|							КОНЕЦ)
	|							И ТаблицаПериодов.ЗавершениеОП > УстановленныеПараметрыРасчетаНорматива.Период
	|				
	|				СГРУППИРОВАТЬ ПО
	|					ТаблицаПериодов.ПериодНачисления,
	|					УстановленныеПараметрыРасчетаНорматива.Организация,
	|					УстановленныеПараметрыРасчетаНорматива.Район,
	|					УстановленныеПараметрыРасчетаНорматива.ТипНачисления,
	|					УстановленныеПараметрыРасчетаНорматива.Услуга,
	|					УстановленныеПараметрыРасчетаНорматива.Разрез,
	|					УстановленныеПараметрыРасчетаНорматива.НаправлениеИспользованияТУ,
	|					УстановленныеПараметрыРасчетаНорматива.СоциальныйНорматив
	|				
	|				ОБЪЕДИНИТЬ ВСЕ
	|				
	|				ВЫБРАТЬ
	|					ТаблицаПериодов.ПериодНачисления,
	|					УстановленныеПараметрыРасчетаНорматива.Организация,
	|					УстановленныеПараметрыРасчетаНорматива.Район,
	|					УстановленныеПараметрыРасчетаНорматива.ТипНачисления,
	|					УстановленныеПараметрыРасчетаНорматива.Услуга,
	|					УстановленныеПараметрыРасчетаНорматива.Разрез,
	|					УстановленныеПараметрыРасчетаНорматива.НаправлениеИспользованияТУ,
	|					УстановленныеПараметрыРасчетаНорматива.СоциальныйНорматив,
	|					МАКСИМУМ(УстановленныеПараметрыРасчетаНорматива.Период)
	|				ИЗ
	|					ТаблицаПериодов КАК ТаблицаПериодов
	|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргУстановленныеПараметрыРасчетаНорматива КАК УстановленныеПараметрыРасчетаНорматива
	|						ПО ТаблицаПериодов.Организация = УстановленныеПараметрыРасчетаНорматива.Организация
	|							И ТаблицаПериодов.Район = УстановленныеПараметрыРасчетаНорматива.Район
	|							И (УстановленныеПараметрыРасчетаНорматива.ТипНачисления = ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.ИндивидуальныеНачисления))
	|							И ТаблицаПериодов.ЗавершениеОП > УстановленныеПараметрыРасчетаНорматива.Период
	|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|						ПО (УстановленныеПараметрыРасчетаНорматива.Услуга = энргВидыУслуг.Ссылка)
	|							И (энргВидыУслуг.НормативДляИндивидуальных)
	|							И (НЕ &ТипНачисления = ЗНАЧЕНИЕ(Перечисление.энргТипыНачислений.ИндивидуальныеНачисления))
	|				
	|				СГРУППИРОВАТЬ ПО
	|					ТаблицаПериодов.ПериодНачисления,
	|					УстановленныеПараметрыРасчетаНорматива.Организация,
	|					УстановленныеПараметрыРасчетаНорматива.Район,
	|					УстановленныеПараметрыРасчетаНорматива.ТипНачисления,
	|					УстановленныеПараметрыРасчетаНорматива.Услуга,
	|					УстановленныеПараметрыРасчетаНорматива.Разрез,
	|					УстановленныеПараметрыРасчетаНорматива.НаправлениеИспользованияТУ,
	|					УстановленныеПараметрыРасчетаНорматива.СоциальныйНорматив) КАК ВложенныйЗапрос
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргУстановленныеПараметрыРасчетаНорматива КАК УстановленныеПараметрыРасчетаНорматива
	|					ПО ВложенныйЗапрос.Организация = УстановленныеПараметрыРасчетаНорматива.Организация
	|						И ВложенныйЗапрос.Район = УстановленныеПараметрыРасчетаНорматива.Район
	|						И ВложенныйЗапрос.ТипНачисления = УстановленныеПараметрыРасчетаНорматива.ТипНачисления
	|						И ВложенныйЗапрос.Услуга = УстановленныеПараметрыРасчетаНорматива.Услуга
	|						И ВложенныйЗапрос.Разрез = УстановленныеПараметрыРасчетаНорматива.Разрез
	|						И ВложенныйЗапрос.НаправлениеИспользованияТУ = УстановленныеПараметрыРасчетаНорматива.НаправлениеИспользованияТУ
	|						И ВложенныйЗапрос.СоциальныйНорматив = УстановленныеПараметрыРасчетаНорматива.СоциальныйНорматив
	|						И ВложенныйЗапрос.Период = УстановленныеПараметрыРасчетаНорматива.Период) КАК ВложенныйЗапрос
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВложенныйЗапрос.ПериодНачисления,
	|			ВложенныйЗапрос.Услуга,
	|			ВложенныйЗапрос.ТипНачисления,
	|			ВложенныйЗапрос.НаправлениеИспользованияТУ,
	|			ВложенныйЗапрос.СоциальныйНорматив) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргУстановленныеПараметрыРасчетаНорматива КАК энргУстановленныеПараметрыРасчетаНорматива
	|			ПО ВложенныйЗапрос.Услуга = энргУстановленныеПараметрыРасчетаНорматива.Услуга
	|				И ВложенныйЗапрос.Период = энргУстановленныеПараметрыРасчетаНорматива.Период
	|				И (энргУстановленныеПараметрыРасчетаНорматива.Организация = &Организация)
	|				И (энргУстановленныеПараметрыРасчетаНорматива.Район = &Район)
	|				И ВложенныйЗапрос.ТипНачисления = энргУстановленныеПараметрыРасчетаНорматива.ТипНачисления
	|				И ВложенныйЗапрос.НаправлениеИспользованияТУ = энргУстановленныеПараметрыРасчетаНорматива.НаправлениеИспользованияТУ
	|				И ВложенныйЗапрос.СоциальныйНорматив = энргУстановленныеПараметрыРасчетаНорматива.СоциальныйНорматив) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.ПериодНачисления,
	|	ВложенныйЗапрос.Услуга,
	|	ВложенныйЗапрос.НаправлениеИспользованияТУ,
	|	ВложенныйЗапрос.СоциальныйНорматив,
	|	ВложенныйЗапрос.ТипНачисления";	
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли
